## Plan Result (ithc_backendappgateway)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 2 to change, 1 to destroy.</code></pre>

* Update
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]
* Delete
  * module.privatedns.azurerm_private_dns_a_record.this[&#34;juror-bureau&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw"
        name                              = "aks00-ithc-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/sds-azure-platform"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "ithc"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/juror-bureau" -> null
          - ip_addresses = [
              - "10.143.15.250",
              - "10.143.31.250",
            ] -> null
          - name         = "juror-bureau" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/darts-api" -> null
          - name                                = "darts-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/darts-api" -> null
          - probe_name                          = "darts-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/darts-gateway" -> null
          - name                                = "darts-gateway" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/darts-gateway" -> null
          - probe_name                          = "darts-gateway" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/darts-stub-services" -> null
          - name                                = "darts-stub-services" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/darts-stub-services" -> null
          - probe_name                          = "darts-stub-services" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/juror-bureau" -> null
          - name                                = "juror-bureau" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/juror-bureau" -> null
          - probe_name                          = "juror-bureau" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/juror-pnc" -> null
          - name                                = "juror-pnc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/juror-pnc" -> null
          - probe_name                          = "juror-pnc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/juror-scheduler-api" -> null
          - name                                = "juror-scheduler-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/juror-scheduler-api" -> null
          - probe_name                          = "juror-scheduler-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/juror-scheduler-execution" -> null
          - name                                = "juror-scheduler-execution" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/juror-scheduler-execution" -> null
          - probe_name                          = "juror-scheduler-execution" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/toffee-recipe-backend" -> null
          - name                                = "toffee-recipe-backend" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/toffee-recipe-backend" -> null
          - probe_name                          = "toffee-recipe-backend" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-admin-web" -> null
          - name                                = "vh-admin-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-admin-web" -> null
          - probe_name                          = "vh-admin-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-bookings-api" -> null
          - name                                = "vh-bookings-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-bookings-api" -> null
          - probe_name                          = "vh-bookings-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-notification-api" -> null
          - name                                = "vh-notification-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-notification-api" -> null
          - probe_name                          = "vh-notification-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-service-web" -> null
          - name                                = "vh-service-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-service-web" -> null
          - probe_name                          = "vh-service-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-test-api" -> null
          - name                                = "vh-test-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-test-api" -> null
          - probe_name                          = "vh-test-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-test-web" -> null
          - name                                = "vh-test-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-test-web" -> null
          - probe_name                          = "vh-test-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-user-api" -> null
          - name                                = "vh-user-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-user-api" -> null
          - probe_name                          = "vh-user-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-video-api" -> null
          - name                                = "vh-video-api" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-video-api" -> null
          - probe_name                          = "vh-video-api" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-video-web" -> null
          - name                                = "vh-video-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/vh-video-web" -> null
          - probe_name                          = "vh-video-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/darts-api"
          + name                                = "darts-api"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/probes/darts-api"
          + probe_name

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

 + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/darts-api"
          + name                       = "darts-api"
          + priority                   = 110
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/darts-gateway"
          + backend_address_pool_name  = "darts-gateway"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/darts-gateway"
          + backend_http_settings_name = "darts-gateway"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/darts-gateway"
          + http_listener_name         = "darts-gateway"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/darts-gateway"
          + name                       = "darts-gateway"
          + priority                   = 120
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/darts-stub-services"
          + backend_address_pool_name  = "darts-stub-services"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/darts-stub-services"
          + backend_http_settings_name = "darts-stub-services"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/darts-stub-services"
          + http_listener_name         = "darts-stub-services"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/darts-stub-services"
          + name                       = "darts-stub-services"
          + priority                   = 130
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/toffee-recipe-backend"
          + backend_address_pool_name  = "toffee-recipe-backend"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/toffee-recipe-backend"
          + backend_http_settings_name = "toffee-recipe-backend"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/toffee-recipe-backend"
          + http_listener_name         = "toffee-recipe-backend"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/toffee-recipe-backend"
          + name                       = "toffee-recipe-backend"
          + priority                   = 10
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-admin-web"
          + backend_address_pool_name  = "vh-admin-web"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-admin-web"
          + backend_http_settings_name = "vh-admin-web"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-admin-web"
          + http_listener_name         = "vh-admin-web"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-admin-web"
          + name                       = "vh-admin-web"
          + priority                   = 70
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-bookings-api"
          + backend_address_pool_name  = "vh-bookings-api"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-bookings-api"
          + backend_http_settings_name = "vh-bookings-api"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-bookings-api"
          + http_listener_name         = "vh-bookings-api"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-bookings-api"
          + name                       = "vh-bookings-api"
          + priority                   = 60
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-notification-api"
          + backend_address_pool_name  = "vh-notification-api"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-notification-api"
          + backend_http_settings_name = "vh-notification-api"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-notification-api"
          + http_listener_name         = "vh-notification-api"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-notification-api"
          + name                       = "vh-notification-api"
          + priority                   = 50
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-service-web"
          + backend_address_pool_name  = "vh-service-web"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-service-web"
          + backend_http_settings_name = "vh-service-web"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-service-web"
          + http_listener_name         = "vh-service-web"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-service-web"
          + name                       = "vh-service-web"
          + priority                   = 90
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-test-api"
          + backend_address_pool_name  = "vh-test-api"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-test-api"
          + backend_http_settings_name = "vh-test-api"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-test-api"
          + http_listener_name         = "vh-test-api"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-test-api"
          + name                       = "vh-test-api"
          + priority                   = 40
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-test-web"
          + backend_address_pool_name  = "vh-test-web"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-test-web"
          + backend_http_settings_name = "vh-test-web"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-test-web"
          + http_listener_name         = "vh-test-web"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-test-web"
          + name                       = "vh-test-web"
          + priority                   = 100
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-user-api"
          + backend_address_pool_name  = "vh-user-api"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-user-api"
          + backend_http_settings_name = "vh-user-api"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-user-api"
          + http_listener_name         = "vh-user-api"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-user-api"
          + name                       = "vh-user-api"
          + priority                   = 20
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-video-api"
          + backend_address_pool_name  = "vh-video-api"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-video-api"
          + backend_http_settings_name = "vh-video-api"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-video-api"
          + http_listener_name         = "vh-video-api"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-video-api"
          + name                       = "vh-video-api"
          + priority                   = 30
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendAddressPools/vh-video-web"
          + backend_address_pool_name  = "vh-video-web"
          + backend_http_settings_id   = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/backendHttpSettingsCollection/vh-video-web"
          + backend_http_settings_name = "vh-video-web"
          + http_listener_id           = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/httpListeners/vh-video-web"
          + http_listener_name         = "vh-video-web"
          + id                         = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw/requestRoutingRules/vh-video-web"
          + name                       = "vh-video-web"
          + priority                   = 80
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "juror-pnc"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "juror-pnc"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "juror-pnc"
          + id                         = (known after apply)
          + name                       = "juror-pnc"
          + priority                   = 160
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "juror-scheduler-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "juror-scheduler-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "juror-scheduler-api"
          + id                         = (known after apply)
          + name                       = "juror-scheduler-api"
          + priority                   = 140
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "juror-scheduler-execution"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "juror-scheduler-execution"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "juror-scheduler-execution"
          + id                         = (known after apply)
          + name                       = "juror-scheduler-execution"
          + priority                   = 150
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      ~ ssl_policy {
          + min_protocol_version = "TLSv1_2"
            # (4 unchanged attributes hidden)
        }

        # (25 unchanged blocks hidden)
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/ba71a911-e0d6-4776-a1a6-079af1df7139/resourceGroups/ss-ithc-network-rg/providers/Microsoft.Network/applicationGateways/aks00-ithc-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.privatedns.azurerm_private_dns_a_record.this["juror-bureau"] will be destroyed
  # (because key ["juror-bureau"] is not in for_each map)
  - resource "azurerm_private_dns_a_record" "this" {
      - fqdn                = "juror-bureau.ithc.platform.hmcts.net." -> null
      - id                  = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/ithc.platform.hmcts.net/A/juror-bureau" -> null
      - name                = "juror-bureau" -> null
      - records             = [
          - "10.143.32.136",
        ] -> null
      - resource_group_name = "core-infra-intsvc-rg" -> null
      - tags                = {} -> null
      - ttl                 = 300 -> null
      - zone_name           = "ithc.platform.hmcts.net" -> null
    }

Plan: 0 to add, 2 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":667,"Program":"tfcmt","SHA1":"","Target":"ithc_backendappgateway","Vars":{}} -->